import 'package:flutter/material.dart';

const int toDoDays = 21;
const int oneDay = 24 * 60 * 60 * 1000;

//snakeBar的Text样式
const TextStyle snakeBarTextStyle = TextStyle(color: Colors.white);

const List<String> sy = [
  '不怕学不成，就怕心不诚',
  '不怕学问浅，就怕志气短',
  '不担三分险，难练一身胆',
  '不磨不炼，不成好汉',
  '木尺虽短，能量千丈',
  '天下无难事，只怕有心人',
  '天无一月雨，人无一世穷',
  '天不生无用之人，地不长无名之草',
  '见强不怕，遇弱不欺',
  '俗语道：月缺不改光，箭折不改钢',
  '水深难见底，虎死不倒威',
  '水往下流，人争上游',
  '只要自己上进，不怕人家看轻',
  '只有上不去的天，没有过不去的山',
  '只怕不勤，不怕不精；只怕无恒，不怕无成',
  '只给君子看门，不给小人当家',
  '鸟贵有翼，人贵有志',
  '只要还有明天，今天就永远是起跑线',
  '火炬倒下，火焰仍然向上',
  '要一言一行一心，要能做能说能写，要看人看己看心',
  '雨是云的梦，云是雨的前世',
  '树没有眼睛，落叶却是飘落的眼泪',
  '天将落大任于斯人也，天不提大免，你不还是斯人吗?',
  '别刚从顶层混起，就混得特殊没底',
  '有时候对一个作家而言，真正的奖赏不是诺贝尔奖，而是窃版',
  '腾不出时光娱乐，迟早会被迫腾出时光生病',
  '一个人心量有多大，事业就有多大,一个人心能容多少，成就就有多少',
  '一个人的成就，在于日积月累；一个人的成功，在于坚毅不拔',
  '怀念是没有翅膀的鸟，在心里盲目标停留不前',
  '阳光涨在春的枝头，日子即绿了',
  '目中无人走自己的路，不是撞到别人，就是被别人碰到',
  '只要比竞争对手活得长，你就赢了',
  '最美的，不必定是最适合的；最合适的，才是真正最好的',
  '历史，只有人名真的；小说，只有人名是假的',
  '人可以穷，心不能穷，心里的能源，取之不尽',
  '身可以残，心不能残，心里的健康，用之不竭',
];
